# **DataFrames**
> ## **GroupBy**
> *Filtragem de dados a partir de alguma característica do DataFrame*
>

> Definindo dicionário data

In [1]:
data = {'Empresa':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Nome':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Venda':[200,120,340,124,243,350]}

In [2]:
import pandas as pd
import numpy as np

> Atribuindo o DataFrame com data como data a df

In [3]:
df = pd.DataFrame(data)

In [4]:
df

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

> Atribuindo o agrupamento dos valores da coluna Empresa em group

In [8]:
group = df.groupby('Empresa')

In [9]:
group

> Realizando a soma da coluna vendas para cada empresa

In [11]:
group.sum('venda')

         Venda
Empresa
FB         593
GOOG       320
MSFT       464

> Descrevendo empresa

In [12]:
group.describe()

        Venda
        count   mean         std    min     25%    50%     75%    max
Empresa
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

> Contando o numero de nome e vendas por empresas

In [13]:
group.count()

         Nome  Venda
Empresa
FB          2      2
GOOG        2      2
MSFT        2      2

> Atribuindo o agrupamento dos valores da coluna Nome em group

In [18]:
group = df.groupby('Nome')

> Somando o valor das vendas para o nome amy

In [20]:
group.sum('Venda').loc['Amy']

Venda    340
Name: Amy, dtype: int64